// Создайте функцию, которая будет принимать в себя один аргумент-целое положительное число. 
//Она должна возвращать строку, в которой будут через пробел выведены числа Фибоначчи. 
// Причем, их количество должно быть равно переданному аргументу.
// Если переданный аргумент не число - вернуть пустую строку. Решать без применения рекурсии.

function fib(num) {
    
}

console.log(fib(4));  //''0 1 1 2"
console.log(fib(7));  //''0 1 1 2 3 5 8"
console.log(fib('7'));  // ''"
console.log(fib(1)); // "0"
console.log(fib(0)); // ''"